Tekla Open API Reference for Tekla Structures 2025
RebarLapping.LapPlacementEnum Enumeration
 The placement of the lap relative to the associated RebarLegFace.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LapPlacementEnum
Public Enumeration LapPlacementEnum
Members
Member name | Value | Description
ON_LEG_FACE | 0 |  On leg face.
PERPENDICULAR_TO_LEG_FACE | 1 |  Perpendicular to leg face.
See Also
Reference
Tekla.Structures.Model Namespace